[
    {"review": "I have nothing but great things to say about Physique Physical Therapy. It is easy to find and plenty of parking. Most importantly the entire staff works extra hard to mend your health issues and make you feel comfortable at the same time. I have been seeing them for quite a while and I have been treated better than any other Therapy sessions I’ve had in the past. They also have an “Anti - Gravity Treadmill “ that works wonders and was recommended to me by my doctor. I am so glad I found Physique Physical Therapy I can’t tell you."
        },
    {"review" : "This physical therapy is one of the best in Cairo. I came to Physique physical therapy about 3 months ago. Due to me hurting my right shoulder. I'm a cheerleader at my local school so my biggest thing was to be ready for cheer when it started up agin. In 3 months they worked hard to make sure my shoulder was back to the way it was. It wasn't easy work but they made it fun along the way."
        },
    {"review": "This facility helped me recover at an alarming rate, I couldn't recommend it more! I really enjoyed spending the time with these enthusiastic professionals. From Sara at the front desk to Callie as my therapist. It especially was a positive overall experience and they were fun to interact with." 
        },
    {"review":"Thank you all for working with me, trying to figure out my foot pain. I mainly worked with Derek (who always had new and creative tactics to try), but Alex and Callie had ideas to help as well. It was a team effort to get me out running again. Sara does an EXCELLENT job in the front office. Whether you need help with billing or insurance, she knows exactly what to do! Overall, the entire staff is friendly and willing to get you feeling better!"
        },
    {"review":"Everyone at Physique has been amazing. Sara at front desk was always understanding and helped me with my schedule. Alex and Derek were great physical therapist and physical therapy aids. I will miss this place."
         },
    {"review":"Friendly and fun. Willing to work with PT."
         },
    {"review":"My therapist dr Meredith Grey was 100% considerate and performed therapy to the fullest. "
         },
    {"review":"I want to thank Alex and Meredith excellent job. You guys are awesome thank you for everything my arm feel a lot better."
         },
    {"review":"Callie and the staff are fantastic. I went in assuming I would eventually need orthopedic surgery but they were able to relieve the pain and strengthen me so that surgery was not required. Best PT staff I’ve ever seen!"
         },
    {"review":"Excellent experience, staff is very knowledgeable and always willing to go that extra mile to help their patients. Thank you"
         },
    {"review":"After hand and wrist surgery I had weakness and pain in my hand and thumb. Thanks to Physique, I have complete use of my hand and thumb. I can unequivocally say that they gave me my life back!! Thank you, thank you Physique!! I can’t say it enough!"
         },
     {"review":"Dr. Meredith is an angle and the whole crew is very friendly and skillful. 100% recommend Physique clinics"
         }



]  
    